Show / Hide Table of Contents
Class LibraryItem
Identification of an item in IDEA StatiCa MPRL (material and product range library)
Inheritance
System.Object
LibraryItem
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
[DataContract]
public class LibraryItem
Properties
Improve this Doc   View Source
Group
Declaration
[DataMember]
public string Group { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
GroupId
Declaration
[DataMember]
public string GroupId { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Identifier
Declaration
[DataMember]
public string Identifier { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Name
Declaration
[DataMember]
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source